aplikasikas/app/Controllers/Iuran.php

SELECT *
FROM `iuran`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `iuran`
---
    public function index()
    {
        // Cari
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $this->IuranModel->search($keyword);
        } else {
            $this->IuranModel->getIuran();
        }

        $currentPage = $this->request->getVar('page_iuran') ? $this->request->getVar('page_iuran') : 1;

        $model = new IuranModel;
        $data = [
            'title' => 'Data Iuran Kas',
            'getIuran' => $model->getIuran(),
            'iuran' => $this->IuranModel->paginate(10, 'iuran'),