aplikasikas/app/Controllers/Warga.php

    public function index()
    {
        // Cari
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $this->WargaModel->search($keyword);
        } else {
            $this->WargaModel->getWarga();
        }

        $currentPage = $this->request->getVar('page_warga') ? $this->request->getVar('page_warga') : 1;
        $data = [
            'title' => 'Data Warga',
            //'warga' => $this->WargaModel->getWarga()
            'warga' => $this->WargaModel->paginate(10, 'warga'),
---
SELECT *
FROM `warga`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `warga`