aplikasikas/app/Models/IuranModel.php

SELECT `iuran`.*, `warga`.`nama` as `nama_warga`, `warga`.`nik` as `nik_warga`, `warga`.`alamat` as `alamat_warga`, `warga`.`no_rumah` as `no_rumah_warga`, `iuran`.`keterangan` as `keterangan`, `iuran`.`tanggal` as `tanggal`
FROM `iuran`
JOIN `warga` ON `warga`.`id` = `iuran`.`warga_id`
---
    public function getIuran($id = false)
    {
        $query = $this->table('iuran')
            ->select('iuran.*,
            warga.nama as nama_warga,
            warga.nik as nik_warga,
            warga.alamat as alamat_warga,
            warga.no_rumah as no_rumah_warga,
            iuran.keterangan as keterangan,
            iuran.tanggal as tanggal
            ')
            ->join('warga', 'warga.id = iuran.warga_id');

        if ($id === false) {
            return $query->get()->getResultArray();

INSERT INTO `iuran` (`keterangan`, `tanggal`, `bulan`, `tahun`, `jumlah`, `warga_id`) VALUES ('Pembayaran Iuran Warga (Cash)', '2023-10-11', '10', '2023', '75000', '26')
---
    public function tambah_iuran($data)
    {
        return $this->db->table($this->table)->insert($data);

SELECT COUNT(*) AS `numrows`
FROM `iuran`
WHERE `warga_id` = '26'
AND `bulan` = '10'
AND `tahun` = '2023'
---
    public function isAlreadyPaid($warga_id, $bulan, $tahun)
    {
        $builder = $this->db->table('iuran');
        $builder->where('warga_id', $warga_id);
        $builder->where('bulan', $bulan);
        $builder->where('tahun', $tahun);

        return $builder->countAllResults() > 0;