aplikasikas/app/Models/WargaModel.php

SELECT *
FROM `warga`
---
    public function getWarga($id = false)
    {
        if ($id === false) {
            return $this->table('warga')
                ->get()
                ->getResultArray();